<template>
  <div class="content">
    <div class="text1">
      先导结构的发现和优化作为新药发现阶段的研究核心，往往需要花费数年时间以及高达数亿美元的资金，是药物研发的关键技术瓶颈。药物分子设计可以看作一个多参数优化问题，其目标是设计出具有多种理想药学性质的新分子。据估计，目前可开采的化学空间约为10<sup>23</sup>至10<sup>60</sup>，在如此巨大的化学空间如何有效实现分子结构的智能生成和快速演化搜索是药物分子设计所面临的巨大挑战。虽然深度学习在药物性质预测和分子结构生成方面取得了许多成果，不过我们的前期工作表明：已报道的深度学习框架存在生成分子的化学空间狭窄、对类药性空间的探索和开采能力有限、难于同时优化多个关键药学参数以及不能有效解决结构新颖性和理想性质之间的冲突等问题。此外，巨大的成药性空间的快速探索和开采需要实现基于国产超级计算机系统的大规模异构并行加速技术的开发和部署。本课题主要利用神经机器翻译、多目标优化、多任务及自监督学习等新型人工智能技术开发药物分子结构智能生成和优化的新技术新方法，并结合天河新一代自主超算系统的新型体系结构，实现大规模异构并行的智能生成和优化加速技术的开发和部署，旨在发展具有自主知识产权的高效全新药物设计算法和软件系统,
      推动我国AI药物设计核心技术研究以及创新药物研究的发展。
    </div>
    <div class="aiddimg">
      <img src="@/assets/img/aidd.png" alt="" />
    </div>
    <div class="text2">
      生物活性分子的发现、成药性和安全性预测及选择性和脱靶效应评估是药物发现阶段的三个关键技术瓶颈，对于提高药物研发成功率、降低研发成本具有重要意义。不过目前制约三个方面的关键在于高质量数据的缺乏及高精度高预测模型的开发。
      <span class="underline">
        针对药物发现中的三个关键问题，申请人创造性地运用上述方法学研究成果发展了活性化合物筛选、成药性和安全性预测及药物-靶标/副作用关系预测等系列高精度预测模型，为这些技术瓶颈的有效解决提供了理论指导和切实可行的解决方案。
      </span>
    </div>
  </div>
</template>

<script setup lang="ts"></script>
<style scoped>
.text1,
.text2 {
  text-indent: 2ch;
  font-size: 20px;
}
.content {
  margin-bottom: 10%;
}
.aiddimg {
  margin-top: 5%;
  margin-bottom: 5%;
  display: flex;
  justify-content: center;
}
img {
  width: 50%;
  height: auto;
  text-align: center;
}

.underline {
  text-decoration: underline;
  font-weight: bold;
}
</style>
